create_clock -period 10.000 -name VIRTUAL_Clk100M_SystemClockGenerator -waveform {0.000 5.000}

set_input_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -min -add_delay 1.000 [get_ports MiSo]
set_input_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -max -add_delay 3.000 [get_ports MiSo]
set_input_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -min -add_delay 1.000 [get_ports Rst]
set_input_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -max -add_delay 3.000 [get_ports Rst]
set_input_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -min -add_delay 1.000 [get_ports UartRx]
set_input_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -max -add_delay 3.000 [get_ports UartRx]
set_output_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -min -add_delay 0.500 [get_ports Active]
set_output_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -max -add_delay 0.500 [get_ports Active]
set_output_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -min -add_delay 0.500 [get_ports Loaded]
set_output_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -max -add_delay 0.500 [get_ports Loaded]
set_output_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -min -add_delay 0.500 [get_ports MoSi]
set_output_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -max -add_delay 1.500 [get_ports MoSi]
set_output_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -min -add_delay 0.500 [get_ports SClk]
set_output_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -max -add_delay 0.500 [get_ports SClk]
set_output_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -min -add_delay 0.500 [get_ports UartTx]
set_output_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -max -add_delay 0.500 [get_ports UartTx]
set_output_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -min -add_delay 0.500 [get_ports nCs]
set_output_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -max -add_delay 1.500 [get_ports nCs]

set_output_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -min -add_delay 0.500 [get_ports Trap]
set_output_delay -clock [get_clocks VIRTUAL_Clk100M_SystemClockGenerator] -max -add_delay 0.500 [get_ports Trap]
